[
    {
        "viewer_id": "1",
        "target_id": "2",
        "score": 88.5,
        "reason": "You're a coder and she's a designer; together you can build the next big thing while exploring art galleries!"
    },
    {
        "viewer_id": "1",
        "target_id": "3",
        "score": 75.0,
        "reason": "Limit your coding sessions with her marathon training; you both value discipline and hard work!"
    },
    {
        "viewer_id": "1",
        "target_id": "4",
        "score": 92.0,
        "reason": "You both love coffee and deep focus; imagine discussing sci-fi novels over a fresh brew at City Lights!"
    },
    {
        "viewer_id": "1",
        "target_id": "5",
        "score": 65.0,
        "reason": "You create with code, he creates with sound; a unique tech-meets-art connection waiting to happen."
    },
    {
        "viewer_id": "1",
        "target_id": "6",
        "score": 82.0,
        "reason": "You've got the tech skills to work remotely, and she has the travel itinerary; perfect digital nomad partners!"
    },
    {
        "viewer_id": "1",
        "target_id": "7",
        "score": 70.0,
        "reason": "You build software, he builds furniture; you both appreciate the craft of making things from scratch."
    },
    {
        "viewer_id": "1",
        "target_id": "8",
        "score": 78.0,
        "reason": "Balance your screen time with her green time; a coding session on her balcony forest sounds peaceful."
    },
    {
        "viewer_id": "1",
        "target_id": "9",
        "score": 95.0,
        "reason": "You both speak the language of tech; from mechanical keyboards to RTX 4090s, you'll never run out of topics!"
    },
    {
        "viewer_id": "1",
        "target_id": "10",
        "score": 60.0,
        "reason": "Tech meets fashion; maybe you can help her build a sustainable fashion app while she restyles your wardrobe!"
    },
    {
        "viewer_id": "2",
        "target_id": "1",
        "score": 88.5,
        "reason": "He's a coder and you're a designer; match made in heaven for building beautiful products together!"
    },
    {
        "viewer_id": "2",
        "target_id": "6",
        "score": 90.0,
        "reason": "You see colors, she sees the world; imagine sketching the landscapes she takes you to!"
    },
    {
        "viewer_id": "3",
        "target_id": "7",
        "score": 85.0,
        "reason": "You build bodies, he builds furniture; both of you respect the grind and physical effort!"
    },
    {
        "viewer_id": "4",
        "target_id": "5",
        "score": 80.0,
        "reason": "A writer and a musician; purely creative souls who can inspire each other's next masterpiece."
    }
]